output/2023-07-24-19-16.log
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.163 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1214000
HTML transferred:       1044000 bytes
Requests per second:    6129.33 [#/sec] (mean)
Time per request:       16.315 [ms] (mean)
Time per request:       0.163 [ms] (mean, across all concurrent requests)
Transfer rate:          7230.69 [Kbytes/sec] received
                        7266.61 kb/s sent
                        14497.30 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       3
Processing:     1   13  22.5      5      82
Waiting:        1   13  22.5      5      82
Total:          1   13  23.2      5      84
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.068 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1214000
HTML transferred:       1044000 bytes
Requests per second:    14692.70 [#/sec] (mean)
Time per request:       6.806 [ms] (mean)
Time per request:       0.068 [ms] (mean, across all concurrent requests)
Transfer rate:          17332.80 [Kbytes/sec] received
                        17418.89 kb/s sent
                        34751.68 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.5      0      10
Processing:     1    5   3.0      3      19
Waiting:        1    5   3.0      3      15
Total:          1    5   5.0      3      25
Benchmark_Config
1000,100,2048
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        2068 bytes

Concurrency Level:      100
Time taken for tests:   0.057 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      2232000 bytes
Total body sent:        2238000
HTML transferred:       2068000 bytes
Requests per second:    17553.41 [#/sec] (mean)
Time per request:       5.697 [ms] (mean)
Time per request:       0.057 [ms] (mean, across all concurrent requests)
Transfer rate:          38260.94 [Kbytes/sec] received
                        38363.79 kb/s sent
                        76624.73 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0       3
Processing:     1    5   5.4      4      24
Waiting:        1    5   5.4      3      24
Total:          1    5   6.2      4      27
Benchmark_Config
1000,100,4096
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        4116 bytes

Concurrency Level:      100
Time taken for tests:   0.068 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      4280000 bytes
Total body sent:        4286000
HTML transferred:       4116000 bytes
Requests per second:    14661.90 [#/sec] (mean)
Time per request:       6.820 [ms] (mean)
Time per request:       0.068 [ms] (mean, across all concurrent requests)
Transfer rate:          61282.15 [Kbytes/sec] received
                        61368.06 kb/s sent
                        122650.20 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       3
Processing:     2    6   5.5      4      25
Waiting:        1    6   5.5      4      25
Total:          2    7   6.3      4      27
Benchmark_Config
1000,100,8192
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        8212 bytes

Concurrency Level:      100
Time taken for tests:   0.075 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      8376000 bytes
Total body sent:        8382000
HTML transferred:       8212000 bytes
Requests per second:    13379.90 [#/sec] (mean)
Time per request:       7.474 [ms] (mean)
Time per request:       0.075 [ms] (mean, across all concurrent requests)
Transfer rate:          109443.36 [Kbytes/sec] received
                        109521.76 kb/s sent
                        218965.12 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0       4
Processing:     2    7   3.1      6      14
Waiting:        2    7   3.1      6      14
Total:          2    7   3.8      6      17
Benchmark_Config
1000,100,16384
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        16404 bytes

Concurrency Level:      100
Time taken for tests:   0.089 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      16569000 bytes
Total body sent:        16575000
HTML transferred:       16404000 bytes
Requests per second:    11174.68 [#/sec] (mean)
Time per request:       8.949 [ms] (mean)
Time per request:       0.089 [ms] (mean, across all concurrent requests)
Transfer rate:          180813.79 [Kbytes/sec] received
                        180879.26 kb/s sent
                        361693.05 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0       5
Processing:     2    7   3.9      6      19
Waiting:        2    7   3.9      6      19
Total:          2    7   5.0      6      24
Benchmark_Config
1000,100,32768
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        32788 bytes

Concurrency Level:      100
Time taken for tests:   0.159 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      32953000 bytes
Total body sent:        32959000
HTML transferred:       32788000 bytes
Requests per second:    6282.35 [#/sec] (mean)
Time per request:       15.918 [ms] (mean)
Time per request:       0.159 [ms] (mean, across all concurrent requests)
Transfer rate:          202170.33 [Kbytes/sec] received
                        202207.14 kb/s sent
                        404377.47 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       5
Processing:     3   15  13.0     10      60
Waiting:        3   15  13.0     10      60
Total:          3   15  14.1     10      64
Benchmark_Config
1000,100,65536
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        65556 bytes

Concurrency Level:      100
Time taken for tests:   0.181 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      65721000 bytes
Total body sent:        65727000
HTML transferred:       65556000 bytes
Requests per second:    5525.29 [#/sec] (mean)
Time per request:       18.099 [ms] (mean)
Time per request:       0.181 [ms] (mean, across all concurrent requests)
Transfer rate:          354616.73 [Kbytes/sec] received
                        354649.11 kb/s sent
                        709265.84 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       4
Processing:     2   17   7.8     15      52
Waiting:        2   17   7.8     15      52
Total:          2   17   8.4     15      56